# pandas class 3 practice

In [1]:
# first import the required packages 
import pandas as pd 
import numpy as np
import os 
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
tit=pd.read_csv("titanic data.csv")

In [3]:
tit.head()
tit.shape
tit.size
tit.head()
tit.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [4]:
#1 we can use the tit dataframe to do saome analysi
tit.dtypes== "object"
a=tit.dtypes[tit.dtypes == "object"].index
tit[a].describe()

                      Name   Sex    Ticket    Cabin Embarked
count                  891   891       891      204      889
unique                 891     2       681      147        3
top     Scanlan, Mr. James  male  CA. 2343  B96 B98        S
freq                     1   577         7        4      644

In [5]:
tit.dtypes == "int64"
b=tit.dtypes[tit.dtypes == "int64"].index
tit[b].describe()

       PassengerId    Survived      Pclass       SibSp       Parch
count   891.000000  891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642    0.523008    0.381594
std     257.353842    0.486592    0.836071    1.102743    0.806057
min       1.000000    0.000000    1.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000    0.000000    0.000000
50%     446.000000    0.000000    3.000000    0.000000    0.000000
75%     668.500000    1.000000    3.000000    1.000000    0.000000
max     891.000000    1.000000    3.000000    8.000000    6.000000

In [6]:
tit.dtypes == "float64"
c=tit.dtypes[tit.dtypes == "float64"].index
tit[c].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [7]:
tit[a].describe()

                      Name   Sex    Ticket    Cabin Embarked
count                  891   891       891      204      889
unique                 891     2       681      147        3
top     Scanlan, Mr. James  male  CA. 2343  B96 B98        S
freq                     1   577         7        4      644

## if you perform a describe function directly on the data frame it will give the output only for the numeric values in the data not for the object

In [8]:
tit.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# if you want to sort the data

- this will generate the series []
- if you use [[]] this will generate dataframe with single column as well

In [9]:
sorted(tit['Name'])[0:5]

['Abbing, Mr. Anthony',
 'Abbott, Mr. Rossmore Edward',
 'Abbott, Mrs. Stanton (Rosa Hunt)',
 'Abelson, Mr. Samuel',
 'Abelson, Mrs. Samuel (Hannah Wizosky)']

In [10]:
max(sorted(tit['Age'])[0:5])

7.0

In [13]:
# if you want to extract all the coloumn name
tit.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# IF you want to change the categorical variables

In [11]:
tit.head()
print(pd.Categorical(tit['Pclass']))
print("\r")
print(pd.Categorical(tit['Sex']))

# by using function 

def cate(col_name):
    return pd.Categorical(tit[col_name])

cate('Pclass')
cate('Sex')

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

[male, female, female, female, male, ..., male, female, female, male, male]
Length: 891
Categories (2, object): [female, male]

[male, female, female, female, male, ..., male, female, female, male, male]
Length: 891
Categories (2, object): [female, male]

In [12]:
# to change the categories in the data 
new_pclass=pd.Categorical(tit['Pclass'])
new_pclass=new_pclass.rename_categories(['class1','class2','class3'])
new_pclass.describe()
tit['new_col']=new_pclass
tit.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,class3
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,class1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,class3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,class1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,class3

# to convert the data to str

In [13]:
print((tit['Cabin'].unique()))

[nan 'C85' 'C123' 'E46' 'G6' 'C103' 'D56' 'A6' 'C23 C25 C27' 'B78' 'D33'
 'B30' 'C52' 'B28' 'C83' 'F33' 'F G73' 'E31' 'A5' 'D10 D12' 'D26' 'C110'
 'B58 B60' 'E101' 'F E69' 'D47' 'B86' 'F2' 'C2' 'E33' 'B19' 'A7' 'C49'
 'F4' 'A32' 'B4' 'B80' 'A31' 'D36' 'D15' 'C93' 'C78' 'D35' 'C87' 'B77'
 'E67' 'B94' 'C125' 'C99' 'C118' 'D7' 'A19' 'B49' 'D' 'C22 C26' 'C106'
 'C65' 'E36' 'C54' 'B57 B59 B63 B66' 'C7' 'E34' 'C32' 'B18' 'C124' 'C91'
 'E40' 'T' 'C128' 'D37' 'B35' 'E50' 'C82' 'B96 B98' 'E10' 'E44' 'A34'
 'C104' 'C111' 'C92' 'E38' 'D21' 'E12' 'E63' 'A14' 'B37' 'C30' 'D20' 'B79'
 'E25' 'D46' 'B73' 'C95' 'B38' 'B39' 'B22' 'C86' 'C70' 'A16' 'C101' 'C68'
 'A10' 'E68' 'B41' 'A20' 'D19' 'D50' 'D9' 'A23' 'B50' 'A26' 'D48' 'E58'
 'C126' 'B71' 'B51 B53 B55' 'D49' 'B5' 'B20' 'F G63' 'C62 C64' 'E24' 'C90'
 'C45' 'E8' 'B101' 'D45' 'C46' 'D30' 'E121' 'D11' 'E77' 'F38' 'B3' 'D6'
 'B82 B84' 'D17' 'A36' 'B102' 'B69' 'E49' 'C47' 'D28' 'E17' 'A24' 'C50'
 'B42' 'C148']

In [14]:
char_cabin=tit['Cabin'].astype(str) 
print(type(char_cabin))
new_cabin=np.array([i[0] for i in char_cabin])
new_cabin=pd.Categorical(new_cabin)
new_cabin.describe()

<class 'pandas.core.series.Series'>

            counts     freqs
categories
A               15  0.016835
B               47  0.052750
C               59  0.066218
D               33  0.037037
E               32  0.035915
F               13  0.014590
G                4  0.004489
T                1  0.001122
n              687  0.771044

# 3. to find the missing and nan values in the coloumns

In [18]:
tit.head()
tit.dtypes == 'object'
tit_new=tit.dtypes[tit.dtypes == 'object'].index
tit[tit_new].describe()

                              Name   Sex Ticket    Cabin Embarked
count                          891   891    891      204      889
unique                         891     2    681      147        3
top     Johansson, Mr. Gustaf Joel  male   1601  B96 B98        S
freq                             1   577      7        4      644

In [19]:
missing_cabin=np.where(tit['Cabin'].isnull()==True)
len(missing_cabin[0])
missing_cabin

(array([  0,   2,   4,   5,   7,   8,   9,  12,  13,  14,  15,  16,  17,
         18,  19,  20,  22,  24,  25,  26,  28,  29,  30,  32,  33,  34,
         35,  36,  37,  38,  39,  40,  41,  42,  43,  44,  45,  46,  47,
         48,  49,  50,  51,  53,  56,  57,  58,  59,  60,  63,  64,  65,
         67,  68,  69,  70,  71,  72,  73,  74,  76,  77,  78,  79,  80,
         81,  82,  83,  84,  85,  86,  87,  89,  90,  91,  93,  94,  95,
         98,  99, 100, 101, 103, 104, 105, 106, 107, 108, 109, 111, 112,
        113, 114, 115, 116, 117, 119, 120, 121, 122, 125, 126, 127, 129,
        130, 131, 132, 133, 134, 135, 138, 140, 141, 142, 143, 144, 145,
        146, 147, 149, 150, 152, 153, 154, 155, 156, 157, 158, 159, 160,
        161, 162, 163, 164, 165, 167, 168, 169, 171, 172, 173, 175, 176,
        178, 179, 180, 181, 182, 184, 186, 187, 188, 189, 190, 191, 192,
        196, 197, 198, 199, 200, 201, 202, 203, 204, 206, 207, 208, 210,
        211, 212, 213, 214, 216, 217, 219, 220, 221, 222, 223, 225, 226,
        227, 228, 229, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240,
        241, 242, 243, 244, 246, 247, 249, 250, 253, 254, 255, 256, 258,
        259, 260, 261, 264, 265, 266, 267, 270, 271, 272, 274, 276, 277,
        278, 279, 280, 281, 282, 283, 285, 286, 287, 288, 289, 290, 293,
        294, 295, 296, 300, 301, 302, 304, 306, 308, 312, 313, 314, 315,
        316, 317, 320, 321, 322, 323, 324, 326, 328, 330, 333, 334, 335,
        338, 342, 343, 344, 346, 347, 348, 349, 350, 352, 353, 354, 355,
        357, 358, 359, 360, 361, 362, 363, 364, 365, 367, 368, 371, 372,
        373, 374, 375, 376, 378, 379, 380, 381, 382, 383, 384, 385, 386,
        387, 388, 389, 391, 392, 395, 396, 397, 398, 399, 400, 401, 402,
        403, 404, 405, 406, 407, 408, 409, 410, 411, 413, 414, 415, 416,
        417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 431,
        432, 433, 436, 437, 439, 440, 441, 442, 443, 444, 446, 447, 448,
        450, 451, 454, 455, 458, 459, 461, 463, 464, 465, 466, 467, 468,
        469, 470, 471, 472, 474, 476, 477, 478, 479, 480, 481, 482, 483,
        485, 488, 489, 490, 491, 493, 494, 495, 497, 499, 500, 501, 502,
        503, 506, 507, 508, 509, 510, 511, 513, 514, 517, 518, 519, 521,
        522, 524, 525, 526, 528, 529, 530, 531, 532, 533, 534, 535, 537,
        538, 541, 542, 543, 545, 546, 547, 548, 549, 551, 552, 553, 554,
        555, 557, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569,
        570, 573, 574, 575, 576, 578, 579, 580, 582, 584, 586, 588, 589,
        590, 592, 593, 594, 595, 596, 597, 598, 600, 601, 602, 603, 604,
        605, 606, 607, 608, 610, 611, 612, 613, 614, 615, 616, 617, 619,
        620, 622, 623, 624, 626, 628, 629, 631, 633, 634, 635, 636, 637,
        638, 639, 640, 642, 643, 644, 646, 648, 649, 650, 651, 652, 653,
        654, 655, 656, 657, 658, 660, 661, 663, 664, 665, 666, 667, 668,
        670, 672, 673, 674, 675, 676, 677, 678, 680, 682, 683, 684, 685,
        686, 687, 688, 691, 692, 693, 694, 695, 696, 697, 702, 703, 704,
        705, 706, 708, 709, 713, 714, 718, 719, 720, 721, 722, 723, 725,
        726, 727, 728, 729, 731, 732, 733, 734, 735, 736, 738, 739, 743,
        744, 746, 747, 749, 750, 752, 753, 754, 755, 756, 757, 758, 760,
        761, 762, 764, 766, 767, 768, 769, 770, 771, 773, 774, 775, 777,
        778, 780, 783, 784, 785, 786, 787, 788, 790, 791, 792, 793, 794,
        795, 797, 798, 799, 800, 801, 803, 804, 805, 807, 808, 810, 811,
        812, 813, 814, 816, 817, 818, 819, 821, 822, 824, 825, 826, 827,
        828, 830, 831, 832, 833, 834, 836, 837, 838, 840, 841, 842, 843,
        844, 845, 846, 847, 848, 850, 851, 852, 854, 855, 856, 858, 859,
        860, 861, 863, 864, 865, 866, 868, 869, 870, 873, 874, 875, 876,
        877, 878, 880, 881, 882, 883, 884, 885, 886, 888, 890], dtype=int64),)

In [20]:
# function for finding the missing value 
def missing(col,nam):
    
    nam=np.where(tit[col].isnull()==True)
    return nam,len(nam[0])
    
missing('Cabin','missing_cabin')

((array([  0,   2,   4,   5,   7,   8,   9,  12,  13,  14,  15,  16,  17,
          18,  19,  20,  22,  24,  25,  26,  28,  29,  30,  32,  33,  34,
          35,  36,  37,  38,  39,  40,  41,  42,  43,  44,  45,  46,  47,
          48,  49,  50,  51,  53,  56,  57,  58,  59,  60,  63,  64,  65,
          67,  68,  69,  70,  71,  72,  73,  74,  76,  77,  78,  79,  80,
          81,  82,  83,  84,  85,  86,  87,  89,  90,  91,  93,  94,  95,
          98,  99, 100, 101, 103, 104, 105, 106, 107, 108, 109, 111, 112,
         113, 114, 115, 116, 117, 119, 120, 121, 122, 125, 126, 127, 129,
         130, 131, 132, 133, 134, 135, 138, 140, 141, 142, 143, 144, 145,
         146, 147, 149, 150, 152, 153, 154, 155, 156, 157, 158, 159, 160,
         161, 162, 163, 164, 165, 167, 168, 169, 171, 172, 173, 175, 176,
         178, 179, 180, 181, 182, 184, 186, 187, 188, 189, 190, 191, 192,
         196, 197, 198, 199, 200, 201, 202, 203, 204, 206, 207, 208, 210,
         211, 212, 213, 214, 216, 217, 219, 220, 221, 222, 223, 225, 226,
         227, 228, 229, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240,
         241, 242, 243, 244, 246, 247, 249, 250, 253, 254, 255, 256, 258,
         259, 260, 261, 264, 265, 266, 267, 270, 271, 272, 274, 276, 277,
         278, 279, 280, 281, 282, 283, 285, 286, 287, 288, 289, 290, 293,
         294, 295, 296, 300, 301, 302, 304, 306, 308, 312, 313, 314, 315,
         316, 317, 320, 321, 322, 323, 324, 326, 328, 330, 333, 334, 335,
         338, 342, 343, 344, 346, 347, 348, 349, 350, 352, 353, 354, 355,
         357, 358, 359, 360, 361, 362, 363, 364, 365, 367, 368, 371, 372,
         373, 374, 375, 376, 378, 379, 380, 381, 382, 383, 384, 385, 386,
         387, 388, 389, 391, 392, 395, 396, 397, 398, 399, 400, 401, 402,
         403, 404, 405, 406, 407, 408, 409, 410, 411, 413, 414, 415, 416,
         417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 431,
         432, 433, 436, 437, 439, 440, 441, 442, 443, 444, 446, 447, 448,
         450, 451, 454, 455, 458, 459, 461, 463, 464, 465, 466, 467, 468,
         469, 470, 471, 472, 474, 476, 477, 478, 479, 480, 481, 482, 483,
         485, 488, 489, 490, 491, 493, 494, 495, 497, 499, 500, 501, 502,
         503, 506, 507, 508, 509, 510, 511, 513, 514, 517, 518, 519, 521,
         522, 524, 525, 526, 528, 529, 530, 531, 532, 533, 534, 535, 537,
         538, 541, 542, 543, 545, 546, 547, 548, 549, 551, 552, 553, 554,
         555, 557, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569,
         570, 573, 574, 575, 576, 578, 579, 580, 582, 584, 586, 588, 589,
         590, 592, 593, 594, 595, 596, 597, 598, 600, 601, 602, 603, 604,
         605, 606, 607, 608, 610, 611, 612, 613, 614, 615, 616, 617, 619,
         620, 622, 623, 624, 626, 628, 629, 631, 633, 634, 635, 636, 637,
         638, 639, 640, 642, 643, 644, 646, 648, 649, 650, 651, 652, 653,
         654, 655, 656, 657, 658, 660, 661, 663, 664, 665, 666, 667, 668,
         670, 672, 673, 674, 675, 676, 677, 678, 680, 682, 683, 684, 685,
         686, 687, 688, 691, 692, 693, 694, 695, 696, 697, 702, 703, 704,
         705, 706, 708, 709, 713, 714, 718, 719, 720, 721, 722, 723, 725,
         726, 727, 728, 729, 731, 732, 733, 734, 735, 736, 738, 739, 743,
         744, 746, 747, 749, 750, 752, 753, 754, 755, 756, 757, 758, 760,
         761, 762, 764, 766, 767, 768, 769, 770, 771, 773, 774, 775, 777,
         778, 780, 783, 784, 785, 786, 787, 788, 790, 791, 792, 793, 794,
         795, 797, 798, 799, 800, 801, 803, 804, 805, 807, 808, 810, 811,
         812, 813, 814, 816, 817, 818, 819, 821, 822, 824, 825, 826, 827,
         828, 830, 831, 832, 833, 834, 836, 837, 838, 840, 841, 842, 843,
         844, 845, 846, 847, 848, 850, 851, 852, 854, 855, 856, 858, 859,
         860, 861, 863, 864, 865, 866, 868, 869, 870, 873, 874, 875, 876,
         877, 878, 880, 881, 882, 883, 884, 885, 886, 888, 890], dtype=int64),),
 687)

### - to extract the rows of the perticular missing values just use .loc

In [21]:
tit[['Survived','Sex','Cabin']].loc[missing_cabin]

     Survived     Sex Cabin
0           0    male   NaN
2           1  female   NaN
4           0    male   NaN
5           0    male   NaN
7           0    male   NaN
..        ...     ...   ...
884         0    male   NaN
885         0  female   NaN
886         0    male   NaN
888         0  female   NaN
890         0    male   NaN

[687 rows x 3 columns]

In [22]:
# pr- to find the person male who paid the maximum amount of fare 

person=tit[(tit['Sex']=='male') &( tit['Fare']==max(tit['Fare']))]
person

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C,class1
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,class1

In [23]:
#case 2 sudanshu sir
index=np.where(tit['Fare']==max(tit['Fare']))
tit.loc[index]
tit.loc[index]['Name']

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

### to add the two coloums or merge

In [24]:
tit.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'new_col'],
      dtype='object')

In [25]:
tit['Family']= tit['SibSp'] + tit['Parch']
tit.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,class3,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,class1,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,class3,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,class1,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,class3,0

# create the random data

In [26]:
from numpy.random import randn as rn

In [27]:
np.random.seed(100)
matrix=rn(5,4)
matrix

array([[-1.74976547,  0.3426804 ,  1.1530358 , -0.25243604],
       [ 0.98132079,  0.51421884,  0.22117967, -1.07004333],
       [-0.18949583,  0.25500144, -0.45802699,  0.43516349],
       [-0.58359505,  0.81684707,  0.67272081, -0.10441114],
       [-0.53128038,  1.02973269, -0.43813562, -1.11831825]])

In [28]:
pd.DataFrame(matrix)

          0         1         2         3
0 -1.749765  0.342680  1.153036 -0.252436
1  0.981321  0.514219  0.221180 -1.070043
2 -0.189496  0.255001 -0.458027  0.435163
3 -0.583595  0.816847  0.672721 -0.104411
4 -0.531280  1.029733 -0.438136 -1.118318

In [30]:
np.random.seed(100)
matrix=rn(5,4)
row_index=['A','B','C','D','E']
col_heading=['col1','col2','col3','col4']
df=pd.DataFrame(matrix,index=row_index,columns=col_heading)

In [40]:
print("\n column name is after addition is \n","-"*35, sep=" ")
df['new']=df['col1']+df['col2']
df

 column name is after addition is
 -----------------------------------

       col1      col2      col3      col4       new
A -1.749765  0.342680  1.153036 -0.252436 -1.407085
B  0.981321  0.514219  0.221180 -1.070043  1.495540
C -0.189496  0.255001 -0.458027  0.435163  0.065506
D -0.583595  0.816847  0.672721 -0.104411  0.233252
E -0.531280  1.029733 -0.438136 -1.118318  0.498452

# to drop the rows and coloumns you can use drop

In [42]:
# to drop the columns
df.drop(['col1','col2'],axis=1)

       col3      col4       new
A  1.153036 -0.252436 -1.407085
B  0.221180 -1.070043  1.495540
C -0.458027  0.435163  0.065506
D  0.672721 -0.104411  0.233252
E -0.438136 -1.118318  0.498452

In [50]:
# to drop the rows
df.drop('B',axis=0,inplace=True)

KeyError: "['B'] not found in axis"

# Conditional filtering using loc and iloc

In [52]:
print(df>0)

    col1  col2   col3   col4    new
A  False  True   True  False  False
C  False  True  False   True   True
D  False  True   True  False   True
E  False  True  False  False   True

In [55]:
print(df[df.loc[['A','D']]>0])

   col1      col2      col3  col4       new
A   NaN  0.342680  1.153036   NaN       NaN
C   NaN       NaN       NaN   NaN       NaN
D   NaN  0.816847  0.672721   NaN  0.233252
E   NaN       NaN       NaN   NaN       NaN

In [67]:
# to create matrix 

matrix_data=np.matrix('20,21,22;22,34,33;56,43,22;43,23,44;33,44,100')
row_labels=['A','B','C','D','E']
col_labels=['Age','Height','Weight']
df=pd.DataFrame(matrix_data,index=row_labels,columns=col_labels)
df

   Age  Height  Weight
A   20      21      22
B   22      34      33
C   56      43      22
D   43      23      44
E   33      44     100

In [79]:
df[(df['Height']<65) & (df['Weight']>55) & (df['Age']<34)]

   Age  Height  Weight Profession
4   33      44     100      Nurse

# reset_index and set_index

- to reset the index of the dataframe there is a function rest_index
> Note. you have to use drop= true inside the reset_index function to drop the existing indexes

In [73]:
df.reset_index(drop=True,inplace=True) # but if you want to permanent change the result use inplace

In [74]:
df

   Age  Height  Weight
0   20      21      22
1   22      34      33
2   56      43      22
3   43      23      44
4   33      44     100

- to set the index

In [77]:
"Student Teacher Engineer Doctor Nurse".split()
df['Profession']= "Student Teacher Engineer Doctor Nurse".split()
df

   Age  Height  Weight Profession
0   20      21      22    Student
1   22      34      33    Teacher
2   56      43      22   Engineer
3   43      23      44     Doctor
4   33      44     100      Nurse

In [78]:
df.set_index('Profession')

            Age  Height  Weight
Profession
Student      20      21      22
Teacher      22      34      33
Engineer     56      43      22
Doctor       43      23      44
Nurse        33      44     100

# MUlti indexing

In [95]:
from numpy.random import randn as rn
np.random.seed(101)
data=rn(9,4)
data
col_name= ['W','X','Y','Z']

In [104]:

l1=['A', 'A', 'A', 'B', 'B', 'B', 'C', 'C', 'C']
l2=[1,2,3,1,2,3,1,2,3]
l3=[1,2,3,4,5,6,7,8,9]
dat=list(zip(l1,l2,l3))

heir_index=pd.MultiIndex.from_tuples(dat)
print(heir_index)

new_data=pd.DataFrame(data,index=heir_index,columns=col_name)
new_data

MultiIndex([('A', 1, 1),
            ('A', 2, 2),
            ('A', 3, 3),
            ('B', 1, 4),
            ('B', 2, 5),
            ('B', 3, 6),
            ('C', 1, 7),
            ('C', 2, 8),
            ('C', 3, 9)],
           )

              W         X         Y         Z
A 1 1  2.706850  0.628133  0.907969  0.503826
  2 2  0.651118 -0.319318 -0.848077  0.605965
  3 3 -2.018168  0.740122  0.528813 -0.589001
B 1 4  0.188695 -0.758872 -0.933237  0.955057
  2 5  0.190794  1.978757  2.605967  0.683509
  3 6  0.302665  1.693723 -1.706086 -1.159119
C 1 7 -0.134841  0.390528  0.166905  0.184502
  2 8  0.807706  0.072960  0.638787  0.329646
  3 9 -0.497104 -0.754070 -0.943406  0.484752

In [103]:
new_data.loc['A'].loc[2].loc[:,'Y']

2   -0.848077
Name: Y, dtype: float64